fusion_mode: bifpn
node_mode: CSP_MSCB
head_channel: 256

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF_LSKA, [1024, 5]]  # 9

# YOLOv8.0n head
head:
  - [4, 1, Conv, [head_channel]]  # 10-P3/8   
  - [6, 1, Conv, [head_channel]]  # 11-P4/16  
  - [9, 1, Conv, [head_channel]]  # 12-P5/32  

  - [11, 1, Conv, [head_channel, 3, 2]] # 13-P5/32
  - [[-1, 12], 1, Fusion, [fusion_mode]] # 14
  - [-1, 3, node_mode, [head_channel, [5,7,9]]] # 15-P5/32

  - [-1, 1, EUCB, []] # 16-P4/16
  - [10, 1, Conv, [head_channel, 3, 2]] # 17-P4/16
  - [[-1, -2, 11], 1, Fusion, [fusion_mode]] # 18
  - [-1, 3, node_mode, [head_channel, [3,5,7]]] # 19-P4/16

  - [-1, 1, EUCB, []] # 20-P3/8
  - [2, 1, Conv, [head_channel, 3, 2]] # 21-P3/8
  - [[-1, -2, 10], 1, Fusion, [fusion_mode]] # 22
  - [-1, 3, node_mode, [head_channel, [1,3,5]]] # 23-P3/8

  - [[20, -1], 1, Fusion, [fusion_mode]] # 24
  - [-1, 3, node_mode, [head_channel, [1,3,5]]] # 25-P3/8

  - [23, 1, Conv, [head_channel, 3, 2]] # 26-P4/16
  - [25, 1, Conv, [head_channel, 3, 2]] # 27-P4/16
  - [[-1, -2, 19, 16], 1, Fusion, [fusion_mode]] # 28-P4/16
  - [-1, 3, node_mode, [head_channel, [3,5,7]]] # 29-P4/16

  - [19, 1, Conv, [head_channel, 3, 2]] # 30-P5/32
  - [29, 1, Conv, [head_channel, 3, 2]] # 31-P5/32
  - [[-1, -2, 15], 1, Fusion, [fusion_mode]] # 32-P5/32
  - [-1, 3, node_mode, [head_channel, [5,7,9]]] # 33-P5/32

  - [[25, 29, 33], 1, Detect, [nc]] # Detect(P3, P4, P5)
